# データサイエンス100本ノック（構造化データ加工編） - SQL

## はじめに
- データベースはPostgreSQL12です
- 初めに以下のセルを実行してください
- セルに %%sql と記載することでSQLを発行することができます
- jupyterからはdescribeコマンドによるテーブル構造の確認ができないため、テーブル構造を確認する場合はlimitを指定したSELECTなどで代用してください
- 使い慣れたSQLクライアントを使っても問題ありません（接続情報は以下の通り）
  - IPアドレス：Docker Desktopの場合はlocalhost、Docker toolboxの場合は192.168.99.100
  - Port:5432
  - database名: dsdojo_db
  - ユーザ名：padawan
  - パスワード:padawan12345
- 大量出力を行うとJupyterが固まることがあるため、出力件数は制限することを推奨します（設問にも出力件数を記載）
    - 結果確認のために表示させる量を適切にコントロールし、作業を軽快にすすめる技術もデータ加工には求められます
- 大量結果が出力された場合は、ファイルが重くなり以降開けなくなることもあります
    - その場合、作業結果は消えますがファイルをGitHubから取り直してください
    - vimエディタなどで大量出力範囲を削除することもできます
- 名前、住所等はダミーデータであり、実在するものではありません

In [1]:
%load_ext sql
import os

pgconfig = {
    'host': 'db',
    'port': os.environ['PG_PORT'],
    'database': os.environ['PG_DATABASE'],
    'user': os.environ['PG_USER'],
    'password': os.environ['PG_PASSWORD'],
}
dsl = 'postgresql://{user}:{password}@{host}:{port}/{database}'.format(**pgconfig)

# MagicコマンドでSQLを書くための設定
%sql $dsl

'Connected: padawan@dsdojo_db'

# 使い方
- セルの先頭に%%sqlと記載し、２行目以降にSQLを記述することでJupyterからPostgreSQLに対しSQLを実行できます。

In [2]:
%%sql
select 'このように実行できます' as sample

 * postgresql://padawan:***@db:5432/dsdojo_db
1 rows affected.

[('このように実行できます',)]

# データ加工100本ノック

# 基礎

---
> S-001: レシート明細テーブル（receipt）から全項目の先頭10件を表示し、どのようなデータを保有しているか目視で確認せよ。

In [ ]:
%%sql
select * from receipt limit 10

---
> S-002: レシート明細のテーブル（receipt）から売上日（sales_ymd）、顧客ID（customer_id）、商品コード（product_cd）、売上金額（amount）の順に列を指定し、10件表示させよ。

In [ ]:
%%sql

---
> S-003: レシート明細のテーブル（receipt）から売上日（sales_ymd）、顧客ID（customer_id）、商品コード（product_cd）、売上金額（amount）の順に列を指定し、10件表示させよ。ただし、sales_ymdはsales_dateに項目名を変更しながら抽出すること。

In [ ]:
%%sql

---
> S-004: レシート明細のテーブル（receipt）から売上日（sales_ymd）、顧客ID（customer_id）、商品コード（product_cd）、売上金額（amount）の順に列を指定し、以下の条件を満たすデータを抽出せよ。
> - 顧客ID（customer_id）が"CS018205000001"

In [ ]:
%%sql

---
> S-005: レシート明細のテーブル（receipt）から売上日（sales_ymd）、顧客ID（customer_id）、商品コード（product_cd）、売上金額（amount）の順に列を指定し、以下の条件を満たすデータを抽出せよ。
> - 顧客ID（customer_id）が"CS018205000001"
> - 売上金額（amount）が1,000以上

In [ ]:
%%sql

---
> S-006: レシート明細テーブル（receipt）から売上日（sales_ymd）、顧客ID（customer_id）、商品コード（product_cd）、売上数量（quantity）、売上金額（amount）の順に列を指定し、以下の条件を満たすデータを抽出せよ。
> - 顧客ID（customer_id）が"CS018205000001"
> - 売上金額（amount）が1,000以上または売上数量（quantity）が5以上

In [ ]:
%%sql

---
> S-007: レシート明細のテーブル（receipt）から売上日（sales_ymd）、顧客ID（customer_id）、商品コード（product_cd）、売上金額（amount）の順に列を指定し、以下の条件を満たすデータを抽出せよ。
> - 顧客ID（customer_id）が"CS018205000001"
> - 売上金額（amount）が1,000以上2,000以下

In [ ]:
%%sql

---
> S-008: レシート明細テーブル（receipt）から売上日（sales_ymd）、顧客ID（customer_id）、商品コード（product_cd）、売上金額（amount）の順に列を指定し、以下の条件を満たすデータを抽出せよ。
> - 顧客ID（customer_id）が"CS018205000001"
> - 商品コード（product_cd）が"P071401019"以外

In [ ]:
%%sql

---
> S-009: 以下の処理において、出力結果を変えずにORをANDに書き換えよ。

`select * from store where not (prefecture_cd = '13' or floor_area > 900)`

In [ ]:
%%sql

---
> S-010: 店舗テーブル（store）から、店舗コード（store_cd）が"S14"で始まるものだけ全項目抽出し、10件だけ表示せよ。

In [ ]:
%%sql

---
> S-011: 顧客テーブル（customer）から顧客ID（customer_id）の末尾が1のものだけ全項目抽出し、10件だけ表示せよ。

In [ ]:
%%sql

---
> S-012: 店舗テーブル（store）から横浜市の店舗だけ全項目表示せよ。

In [ ]:
%%sql

---
> S-013: 顧客テーブル（customer）から、ステータスコード（status_cd）の先頭がアルファベットのA〜Fで始まるデータを全項目抽出し、10件だけ表示せよ。

In [ ]:
%%sql

---
> S-014: 顧客テーブル（customer）から、ステータスコード（status_cd）の末尾が数字の1〜9で終わるデータを全項目抽出し、10件だけ表示せよ。

In [ ]:
%%sql

---
> S-015: 顧客テーブル（customer）から、ステータスコード（status_cd）の先頭がアルファベットのA〜Fで始まり、末尾が数字の1〜9で終わるデータを全項目抽出し、10件だけ表示せよ。

In [ ]:
%%sql

---
> S-016: 店舗テーブル（store）から、電話番号（tel_no）が3桁-3桁-4桁のデータを全項目表示せよ。

In [ ]:
%%sql

---
> S-017: 顧客テーブル（customer）を生年月日（birth_day）で高齢順にソートし、先頭10件を全項目表示せよ。

In [ ]:
%%sql

---
> S-018: 顧客テーブル（customer）を生年月日（birth_day）で若い順にソートし、先頭10件を全項目表示せよ。

In [ ]:
%%sql

# RANK, ROW_NUMBER

---
> S-019: レシート明細テーブル（receipt）に対し、1件あたりの売上金額（amount）が高い順にランクを付与し、先頭10件を抽出せよ。項目は顧客ID（customer_id）、売上金額（amount）、付与したランクを表示させること。なお、売上金額（amount）が等しい場合は同一順位を付与するものとする。

In [16]:
%%sql

SELECT customer_id,amount,RANK() OVER(ORDER BY amount DESC) AS ranking 
FROM receipt 
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS011415000006', 10925, 1),
 ('ZZ000000000000', 6800, 2),
 ('CS028605000002', 5780, 3),
 ('ZZ000000000000', 5480, 4),
 ('CS015515000034', 5480, 4),
 ('ZZ000000000000', 5480, 4),
 ('ZZ000000000000', 5440, 7),
 ('CS021515000089', 5440, 7),
 ('ZZ000000000000', 5280, 9),
 ('CS008513000063', 5280, 9)]

---
> S-020: レシート明細テーブル（receipt）に対し、1件あたりの売上金額（amount）が高い順にランクを付与し、先頭10件を抽出せよ。項目は顧客ID（customer_id）、売上金額（amount）、付与したランクを表示させること。なお、売上金額（amount）が等しい場合でも別順位を付与すること。

In [17]:
%%sql
SELECT customer_id,amount,ROW_NUMBER() OVER(ORDER BY amount DESC)
FROM receipt
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS011415000006', 10925, 1),
 ('ZZ000000000000', 6800, 2),
 ('CS028605000002', 5780, 3),
 ('ZZ000000000000', 5480, 4),
 ('CS015515000034', 5480, 5),
 ('ZZ000000000000', 5480, 6),
 ('ZZ000000000000', 5440, 7),
 ('CS021515000089', 5440, 8),
 ('ZZ000000000000', 5280, 9),
 ('ZZ000000000000', 5280, 10)]

---
> S-021: レシート明細テーブル（receipt）に対し、件数をカウントせよ。

# COUNT, SUM, MAX, MIN, AVG

In [ ]:
%%sql
SELECT COUNT(*) FROM receipt

---
> S-022: レシート明細テーブル（receipt）の顧客ID（customer_id）に対し、ユニーク件数をカウントせよ。

In [28]:
%%sql
SELECT COUNT(DISTINCT customer_id) FROM receipt

 * postgresql://padawan:***@db:5432/dsdojo_db
1 rows affected.

[(8307,)]

---
> S-023: レシート明細テーブル（receipt）に対し、店舗コード（store_cd）ごとに売上金額（amount）と売上数量（quantity）を合計せよ。

In [30]:
%%sql
SELECT store_cd,SUM(amount) AS amount,SUM(quantity) AS quantity
FROM receipt
GROUP BY store_cd
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('S12007', 638761, 2099),
 ('S13017', 748221, 2376),
 ('S13043', 587895, 1881),
 ('S13052', 100314, 250),
 ('S13016', 793773, 2432),
 ('S14027', 714550, 2303),
 ('S13009', 808870, 2486),
 ('S14022', 651328, 2047),
 ('S13019', 827833, 2541),
 ('S13039', 611888, 1981)]

---
> S-024: レシート明細テーブル（receipt）に対し、顧客ID（customer_id）ごとに最も新しい売上日（sales_ymd）を求め、10件表示せよ。

In [37]:
%%sql
SELECT customer_id,MAX(sales_ymd) AS newest_ymd
FROM receipt 
GROUP BY customer_id
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS001311000059', 20180211),
 ('CS004614000122', 20181228),
 ('CS003512000043', 20180106),
 ('CS011615000061', 20190503),
 ('CS029212000033', 20180621),
 ('CS007515000119', 20190511),
 ('CS034515000123', 20190708),
 ('CS004315000058', 20170517),
 ('CS026414000014', 20190720),
 ('CS001615000099', 20170729)]

---
> S-025: レシート明細テーブル（receipt）に対し、顧客ID（customer_id）ごとに最も古い売上日（sales_ymd）を求め、10件表示せよ。

In [36]:
%%sql
SELECT customer_id,MIN(sales_ymd) AS oldest_ymd
FROM receipt
GROUP BY customer_id
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS001311000059', 20180211),
 ('CS004614000122', 20181228),
 ('CS003512000043', 20180106),
 ('CS011615000061', 20190503),
 ('CS029212000033', 20170318),
 ('CS007515000119', 20170201),
 ('CS034515000123', 20170527),
 ('CS004315000058', 20170517),
 ('CS026414000014', 20170718),
 ('CS001615000099', 20170729)]

---
> S-026: レシート明細テーブル（receipt）に対し、顧客ID（customer_id）ごとに最も新しい売上日（sales_ymd）と古い売上日を求め、両者が異なるデータを10件表示せよ。

In [40]:
%%sql
SELECT customer_id, MIN(sales_ymd) AS oldest_ymd, MAX(sales_ymd) AS newest_ymd
FROM receipt
GROUP BY customer_id
HAVING MIN(sales_ymd)!=MAX(sales_ymd)
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS029212000033', 20170318, 20180621),
 ('CS007515000119', 20170201, 20190511),
 ('CS034515000123', 20170527, 20190708),
 ('CS026414000014', 20170718, 20190720),
 ('CS010515000082', 20180518, 20181204),
 ('CS019315000045', 20170423, 20170920),
 ('CS008513000099', 20170722, 20190308),
 ('CS007615000070', 20170929, 20191025),
 ('CS025415000155', 20170314, 20191026),
 ('CS016414000063', 20170109, 20190617)]

---
> S-027: レシート明細テーブル（receipt）に対し、店舗コード（store_cd）ごとに売上金額（amount）の平均を計算し、降順でTOP5を表示せよ。

In [44]:
%%sql
SELECT store_cd,AVG(amount) AS avg_amount
FROM receipt
GROUP BY store_cd
ORDER BY AVG(amount) DESC
LIMIT 5

 * postgresql://padawan:***@db:5432/dsdojo_db
5 rows affected.

[('S13052', Decimal('402.8674698795180723')),
 ('S13015', Decimal('351.1119604316546763')),
 ('S13003', Decimal('350.9155188246097337')),
 ('S14010', Decimal('348.7912621359223301')),
 ('S13001', Decimal('348.4703862660944206'))]

---
> S-028: レシート明細テーブル（receipt）に対し、店舗コード（store_cd）ごとに売上金額（amount）の中央値を計算し、降順でTOP5を表示せよ。

# PERCENTILE_CONT

In [46]:
%%sql
SELECT 
    store_cd,
    PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY amount) AS middle_value
FROM receipt
GROUP BY store_cd
ORDER BY middle_value DESC
LIMIT 5

 * postgresql://padawan:***@db:5432/dsdojo_db
5 rows affected.

[('S13052', 190.0),
 ('S14010', 188.0),
 ('S14050', 185.0),
 ('S13003', 180.0),
 ('S13018', 180.0)]

---
> S-029: レシート明細テーブル（receipt）に対し、店舗コード（store_cd）ごとに商品コード（product_cd）の最頻値を求めよ。

# WITH句

In [52]:
%%sql
WITH modes AS (    
    SELECT
        store_cd,product_cd,
        COUNT(1) AS mode_val,
        RANK() OVER(PARTITION BY store_cd ORDER BY COUNT(1) DESC) AS rank
    FROM receipt
    GROUP BY store_cd,product_cd
)
SELECT store_cd,product_cd,mode_val
FROM modes
WHERE rank=1
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('S12007', 'P060303001', 72),
 ('S12013', 'P060303001', 107),
 ('S12014', 'P060303001', 65),
 ('S12029', 'P060303001', 92),
 ('S12030', 'P060303001', 115),
 ('S13001', 'P060303001', 67),
 ('S13002', 'P060303001', 78),
 ('S13003', 'P071401001', 65),
 ('S13004', 'P060303001', 88),
 ('S13005', 'P040503001', 36)]

---
> S-030: レシート明細テーブル（receipt）に対し、店舗コード（store_cd）ごとに売上金額（amount）の標本分散を計算し、降順でTOP5を表示せよ。

# VAR_POP, STDDEV_POP, PERCENTILE_CONT

In [55]:
%%sql
SELECT 
    store_cd,
    VAR_POP(amount) AS var_amount
FROM receipt
GROUP BY store_cd
ORDER BY var_amount DESC
LIMIT 5

 * postgresql://padawan:***@db:5432/dsdojo_db
5 rows affected.

[('S13052', Decimal('440088.701311269173')),
 ('S14011', Decimal('306314.558163888889')),
 ('S14034', Decimal('296920.081011283873')),
 ('S13001', Decimal('295431.993329035348')),
 ('S13015', Decimal('295294.361115940880'))]

---
> S-031: レシート明細テーブル（receipt）に対し、店舗コード（store_cd）ごとに売上金額（amount）の標本標準偏差を計算し、降順でTOP5を表示せよ。

In [56]:
%%sql
SELECT 
    store_cd,
    STDDEV_POP(amount) AS std_amount
FROM receipt
GROUP BY store_cd
ORDER BY std_amount DESC
LIMIT 5

 * postgresql://padawan:***@db:5432/dsdojo_db
5 rows affected.

[('S13052', Decimal('663.391815830787')),
 ('S14011', Decimal('553.456916267101')),
 ('S14034', Decimal('544.903735545357')),
 ('S13001', Decimal('543.536561170484')),
 ('S13015', Decimal('543.409938366921'))]

---
> S-032: レシート明細テーブル（receipt）の売上金額（amount）について、25％刻みでパーセンタイル値を求めよ。

In [57]:
%%sql
SELECT 
    PERCENTILE_CONT(0.25) WITHIN GROUP (ORDER BY amount) AS amount_25per,
    PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY amount) AS amount_50per,
    PERCENTILE_CONT(0.75) WITHIN GROUP (ORDER BY amount) AS amount_75per,
    PERCENTILE_CONT(1) WITHIN GROUP (ORDER BY amount) AS amount_100per
FROM receipt

 * postgresql://padawan:***@db:5432/dsdojo_db
1 rows affected.

[(102.0, 170.0, 288.0, 10925.0)]

---
> S-033: レシート明細テーブル（receipt）に対し、店舗コード（store_cd）ごとに売上金額（amount）の平均を計算し、330以上のものを抽出せよ。

In [59]:
%%sql
SELECT store_cd,AVG(amount) AS avg_amount
FROM receipt
GROUP BY store_cd
HAVING AVG(amount)>=330

 * postgresql://padawan:***@db:5432/dsdojo_db
13 rows affected.

[('S13052', Decimal('402.8674698795180723')),
 ('S13019', Decimal('330.2086158755484643')),
 ('S13003', Decimal('350.9155188246097337')),
 ('S14045', Decimal('330.0820734341252700')),
 ('S13004', Decimal('330.9439490445859873')),
 ('S13001', Decimal('348.4703862660944206')),
 ('S14026', Decimal('332.3405884723901653')),
 ('S14010', Decimal('348.7912621359223301')),
 ('S13015', Decimal('351.1119604316546763')),
 ('S12013', Decimal('330.1941299790356394')),
 ('S14047', Decimal('330.0770731707317073')),
 ('S14011', Decimal('335.7183333333333333')),
 ('S13020', Decimal('337.8799321170980059'))]

---
> S-034: レシート明細テーブル（receipt）に対し、顧客ID（customer_id）ごとに売上金額（amount）を合計して全顧客の平均を求めよ。ただし、顧客IDが"Z"から始まるのものは非会員を表すため、除外して計算すること。

In [62]:
%%sql
WITH sum_per_customer AS (
    SELECT customer_id,SUM(amount) AS sum_amount
    FROM receipt
    WHERE customer_id NOT LIKE 'Z%'
    GROUP BY customer_id
)
SELECT AVG(sum_amount) AS avg_customer_amount
FROM sum_per_customer

 * postgresql://padawan:***@db:5432/dsdojo_db
1 rows affected.

[(Decimal('2547.7422345292559595'),)]

---
> S-035: レシート明細テーブル（receipt）に対し、顧客ID（customer_id）ごとに売上金額（amount）を合計して全顧客の平均を求め、平均以上に買い物をしている顧客を抽出せよ。ただし、顧客IDが"Z"から始まるのものは非会員を表すため、除外して計算すること。なお、データは10件だけ表示させれば良い。

In [68]:
%%sql
WITH sum_per_customer AS (
    SELECT customer_id,SUM(amount) AS sum_amount
    FROM receipt
    WHERE customer_id NOT LIKE 'Z%'
    GROUP BY customer_id
)
SELECT customer_id,sum_amount
FROM sum_per_customer
WHERE sum_amount>=(SELECT AVG(sum_amount) FROM sum_per_customer)
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS029212000033', 3604),
 ('CS007515000119', 7157),
 ('CS034515000123', 3699),
 ('CS026414000014', 6671),
 ('CS007615000070', 2975),
 ('CS016414000063', 6207),
 ('CS012514000018', 2562),
 ('CS029515000142', 3420),
 ('CS015215000021', 3090),
 ('CS039814000011', 8031)]

# JOIN

---
> S-036: レシート明細テーブル（receipt）と店舗テーブル（store）を内部結合し、レシート明細テーブルの全項目と店舗テーブルの店舗名（store_name）を10件表示させよ。

In [78]:
%%sql
SELECT receipt.*,store.store_name
FROM receipt
JOIN store
ON receipt.store_cd=store.store_cd
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[(20181103, 1541203200, 'S14006', 112, 1, 'CS006214000001', 'P070305012', 1, 158, '葛が谷店'),
 (20181118, 1542499200, 'S13008', 1132, 2, 'CS008415000097', 'P070701017', 1, 81, '成城店'),
 (20170712, 1499817600, 'S14028', 1102, 1, 'CS028414000014', 'P060101005', 1, 170, '二ツ橋店'),
 (20190205, 1549324800, 'S14042', 1132, 1, 'ZZ000000000000', 'P050301001', 1, 25, '新山下店'),
 (20180821, 1534809600, 'S14025', 1102, 2, 'CS025415000050', 'P060102007', 1, 90, '大和店'),
 (20190605, 1559692800, 'S13003', 1112, 1, 'CS003515000195', 'P050102002', 1, 138, '狛江店'),
 (20181205, 1543968000, 'S14024', 1102, 2, 'CS024514000042', 'P080101005', 1, 30, '三田店'),
 (20190922, 1569110400, 'S14040', 1102, 1, 'CS040415000178', 'P070501004', 1, 128, '長津田店'),
 (20170504, 1493856000, 'S13020', 1112, 2, 'ZZ000000000000', 'P071302010', 1, 770, '十条仲原店'),
 (20191010, 1570665600, 'S14027', 1102, 1, 'CS027514000015', 'P071101003', 1, 680, '南藤沢店')]

---
> S-037: 商品テーブル（product）とカテゴリテーブル（category）を内部結合し、商品テーブルの全項目とカテゴリテーブルの小区分名（category_small_name）を10件表示させよ。

In [82]:
%%sql
SELECT product.*,category.category_small_name
FROM product
JOIN category
ON product.category_small_cd=category.category_small_cd
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('P040101001', '04', '0401', '040101', 198, 149, '弁当類'),
 ('P040101002', '04', '0401', '040101', 218, 164, '弁当類'),
 ('P040101003', '04', '0401', '040101', 230, 173, '弁当類'),
 ('P040101004', '04', '0401', '040101', 248, 186, '弁当類'),
 ('P040101005', '04', '0401', '040101', 268, 201, '弁当類'),
 ('P040101006', '04', '0401', '040101', 298, 224, '弁当類'),
 ('P040101007', '04', '0401', '040101', 338, 254, '弁当類'),
 ('P040101008', '04', '0401', '040101', 420, 315, '弁当類'),
 ('P040101009', '04', '0401', '040101', 498, 374, '弁当類'),
 ('P040101010', '04', '0401', '040101', 580, 435, '弁当類')]

---
> S-038: 顧客テーブル（customer）とレシート明細テーブル（receipt）から、各顧客ごとの売上金額合計を求めよ。ただし、売上実績がない顧客については売上金額を0として表示させること。また、顧客は性別コード（gender_cd）が女性（1）であるものを対象とし、非会員（顧客IDが"Z"から始まるもの）は除外すること。なお、結果は10件だけ表示させれば良い。

In [110]:
%%sql
WITH c_sum AS (
    SELECT customer_id,SUM(amount) AS sum_amount
    FROM receipt
    GROUP BY customer_id
)
SELECT customer.customer_id,COALESCE(c_sum.sum_amount,0)
FROM customer
LEFT JOIN c_sum
ON customer.customer_id=c_sum.customer_id
WHERE customer.gender_cd='1' AND customer.customer_id NOT LIKE 'Z%'
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS021313000114', 0),
 ('CS031415000172', 5088),
 ('CS028811000001', 0),
 ('CS001215000145', 875),
 ('CS015414000103', 3122),
 ('CS033513000180', 868),
 ('CS035614000014', 0),
 ('CS011215000048', 3444),
 ('CS009413000079', 0),
 ('CS040412000191', 210)]

---
> S-039: レシート明細テーブル（receipt）から売上日数の多い顧客の上位20件と、売上金額合計の多い顧客の上位20件を抽出し、完全外部結合せよ。ただし、非会員（顧客IDが"Z"から始まるもの）は除外すること。

In [115]:
%%sql
WITH 
by_days AS (
    SELECT customer_id,COUNT(DISTINCT sales_ymd) AS sales_days
    FROM receipt
    WHERE customer_id NOT LIKE 'Z%'
    GROUP BY customer_id
    
    ORDER BY sales_days DESC
    LIMIT 20
),
by_amounts AS (
    SELECT customer_id,SUM(amount) AS sum_amount
    FROM receipt
    WHERE customer_id NOT LIKE 'Z%'
    GROUP BY customer_id
    
    ORDER BY sum_amount DESC
    LIMIT 20
)
SELECT by_days.*,by_amounts.sum_amount
FROM by_days
FULL OUTER JOIN by_amounts
ON by_days.customer_id=by_amounts.customer_id

 * postgresql://padawan:***@db:5432/dsdojo_db
34 rows affected.

[('CS040214000008', 23, None),
 ('CS015415000185', 22, 20153),
 ('CS010214000010', 22, 18585),
 ('CS028415000007', 21, 19127),
 ('CS010214000002', 21, None),
 ('CS017415000097', 20, 23086),
 ('CS016415000141', 20, 18372),
 ('CS021514000045', 19, None),
 ('CS022515000226', 19, None),
 ('CS031414000051', 19, 19202),
 ('CS039414000052', 19, None),
 ('CS014214000023', 19, None),
 ('CS021515000172', 19, None),
 ('CS031414000073', 18, None),
 ('CS007515000107', 18, None),
 ('CS014415000077', 18, None),
 ('CS021515000056', 18, None),
 ('CS032415000209', 18, None),
 ('CS021515000211', 18, None),
 ('CS022515000028', 18, None),
 (None, None, 16094),
 (None, None, 16348),
 (None, None, 15468),
 (None, None, 17580),
 (None, None, 16083),
 (None, None, 18372),
 (None, None, 17847),
 (None, None, 15300),
 (None, None, 16563),
 (None, None, 18338),
 (None, None, 18925),
 (None, None, 15492),
 (None, None, 17615),
 (None, None, 15735)]

---
> S-040: 全ての店舗と全ての商品を組み合わせると何件のデータとなるか調査したい。店舗（store）と商品（product）を直積した件数を計算せよ。

In [116]:
%%sql
SELECT COUNT(1)
FROM store
CROSS JOIN product

 * postgresql://padawan:***@db:5432/dsdojo_db
1 rows affected.

[(531590,)]

# LAG, TRUNC, UNIONALL

---
> S-041: レシート明細テーブル（receipt）の売上金額（amount）を日付（sales_ymd）ごとに集計し、前日からの売上金額増減を計算せよ。なお、計算結果は10件表示すればよい。

In [123]:
%%sql
WITH sum_amount_by_ymd AS(
    SELECT sales_ymd,SUM(amount) AS sum_amount
    FROM receipt
    GROUP BY sales_ymd
    ORDER BY sales_ymd
)
SELECT
    sales_ymd,
    LAG(sales_ymd,1) OVER (ORDER BY sales_ymd) AS lag_ymd,
    sum_amount,
    LAG(sum_amount,1) OVER (ORDER BY sales_ymd) AS lag_amount,
    sum_amount-LAG(sum_amount,1) OVER (ORDER BY sales_ymd)  AS diff_amount
FROM sum_amount_by_ymd
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[(20170101, None, 33723, None, None),
 (20170102, 20170101, 24165, 33723, -9558),
 (20170103, 20170102, 27503, 24165, 3338),
 (20170104, 20170103, 36165, 27503, 8662),
 (20170105, 20170104, 37830, 36165, 1665),
 (20170106, 20170105, 32387, 37830, -5443),
 (20170107, 20170106, 23415, 32387, -8972),
 (20170108, 20170107, 24737, 23415, 1322),
 (20170109, 20170108, 26718, 24737, 1981),
 (20170110, 20170109, 20143, 26718, -6575)]

---
> S-042: レシート明細テーブル（receipt）の売上金額（amount）を日付（sales_ymd）ごとに集計し、各日付のデータに対し、１日前、２日前、３日前のデータを結合せよ。結果は10件表示すればよい。

In [129]:
%%sql
WITH 
    sum_amount_by_ymd AS (
        SELECT sales_ymd,SUM(amount) AS sum_amount
        FROM receipt
        GROUP BY sales_ymd
    ),
    lag_sum AS(
        SELECT 
            sales_ymd,
            sum_amount,
            LAG(sales_ymd,1) OVER (ORDER BY sales_ymd) AS lag_ymd_1,
            LAG(sum_amount,1) OVER (ORDER BY sales_ymd) AS lag_sum_1,
            LAG(sales_ymd,2) OVER (ORDER BY sales_ymd) AS lag_ymd_2,
            LAG(sum_amount,2) OVER (ORDER BY sales_ymd) AS lag_sum_2,
            LAG(sales_ymd,3) OVER (ORDER BY sales_ymd) AS lag_ymd_3,
            LAG(sum_amount,3) OVER (ORDER BY sales_ymd) AS lag_sum_3
        FROM sum_amount_by_ymd
    )
SELECT *
FROM lag_sum
WHERE lag_ymd_3 IS NOT NULL
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[(20170104, 36165, 20170103, 27503, 20170102, 24165, 20170101, 33723),
 (20170105, 37830, 20170104, 36165, 20170103, 27503, 20170102, 24165),
 (20170106, 32387, 20170105, 37830, 20170104, 36165, 20170103, 27503),
 (20170107, 23415, 20170106, 32387, 20170105, 37830, 20170104, 36165),
 (20170108, 24737, 20170107, 23415, 20170106, 32387, 20170105, 37830),
 (20170109, 26718, 20170108, 24737, 20170107, 23415, 20170106, 32387),
 (20170110, 20143, 20170109, 26718, 20170108, 24737, 20170107, 23415),
 (20170111, 24287, 20170110, 20143, 20170109, 26718, 20170108, 24737),
 (20170112, 23526, 20170111, 24287, 20170110, 20143, 20170109, 26718),
 (20170113, 28004, 20170112, 23526, 20170111, 24287, 20170110, 20143)]

---
> S-043: レシート明細テーブル（receipt）と顧客テーブル（customer）を結合し、性別（gender）と年代（ageから計算）ごとに売上金額（amount）を合計した売上サマリテーブル（sales_summary）を作成せよ。性別は0が男性、1が女性、9が不明を表すものとする。
>
>ただし、項目構成は年代、女性の売上金額、男性の売上金額、性別不明の売上金額の4項目とすること（縦に年代、横に性別のクロス集計）。また、年代は10歳ごとの階級とすること。

In [174]:
%%sql
WITH 
    group_by_gender_age AS (
        SELECT 
            c.gender_cd,
            TRUNC(c.age/10)*10 AS era,
            SUM(amount) AS sum_amount
        FROM receipt AS r
        JOIN customer AS c
        ON r.customer_id=c.customer_id
        GROUP BY c.gender_cd,era
    ),
    gender_era AS (
        SELECT 
            era,
            MAX(CASE gender_cd WHEN '0' THEN sum_amount ELSE 0 END) AS male,
            MAX(CASE gender_cd WHEN '1' THEN sum_amount ELSE 0 END) AS female,
            MAX(CASE gender_cd WHEN '9' THEN sum_amount ELSE 0 END) AS unknown
        FROM group_by_gender_age
        GROUP BY era 
    )
SELECT *
FROM gender_era

 * postgresql://padawan:***@db:5432/dsdojo_db
9 rows affected.

[(10.0, 1591, 149836, 4317),
 (20.0, 72940, 1363724, 44328),
 (30.0, 177322, 693047, 50441),
 (40.0, 19355, 9320791, 483512),
 (50.0, 54320, 6685192, 342923),
 (60.0, 272469, 987741, 71418),
 (70.0, 13435, 29764, 2427),
 (80.0, 46360, 262923, 5111),
 (90.0, 0, 6260, 0)]

---
> S-044: 前設問で作成した売上サマリテーブル（sales_summary）は性別の売上を横持ちさせたものであった。このテーブルから性別を縦持ちさせ、年代、性別コード、売上金額の3項目に変換せよ。ただし、性別コードは男性を"00"、女性を"01"、不明を"99"とする。

In [181]:
%%sql
WITH 
    group_by_gender_age AS (
        SELECT 
            c.gender_cd,
            TRUNC(c.age/10)*10 AS era,
            SUM(amount) AS sum_amount
        FROM receipt AS r
        JOIN customer AS c
        ON r.customer_id=c.customer_id
        GROUP BY c.gender_cd,era
    ),
    gender_era AS (
        SELECT 
            era,
            MAX(CASE gender_cd WHEN '0' THEN sum_amount ELSE 0 END) AS male,
            MAX(CASE gender_cd WHEN '1' THEN sum_amount ELSE 0 END) AS female,
            MAX(CASE gender_cd WHEN '9' THEN sum_amount ELSE 0 END) AS unknown
        FROM group_by_gender_age
        GROUP BY era 
    )
SELECT era,'00' AS gender,male AS amount FROM gender_era
UNION ALL
SELECT era,'01' AS gender,female AS amount FROM gender_era
UNION ALL
SELECT era,'99' AS gender,unknown AS amount FROM gender_era

 * postgresql://padawan:***@db:5432/dsdojo_db
27 rows affected.

[(10.0, '00', 1591),
 (20.0, '00', 72940),
 (30.0, '00', 177322),
 (40.0, '00', 19355),
 (50.0, '00', 54320),
 (60.0, '00', 272469),
 (70.0, '00', 13435),
 (80.0, '00', 46360),
 (90.0, '00', 0),
 (10.0, '01', 149836),
 (20.0, '01', 1363724),
 (30.0, '01', 693047),
 (40.0, '01', 9320791),
 (50.0, '01', 6685192),
 (60.0, '01', 987741),
 (70.0, '01', 29764),
 (80.0, '01', 262923),
 (90.0, '01', 6260),
 (10.0, '99', 4317),
 (20.0, '99', 44328),
 (30.0, '99', 50441),
 (40.0, '99', 483512),
 (50.0, '99', 342923),
 (60.0, '99', 71418),
 (70.0, '99', 2427),
 (80.0, '99', 5111),
 (90.0, '99', 0)]

# 日付

---
> S-045: 顧客テーブル（customer）の生年月日（birth_day）は日付型でデータを保有している。これをYYYYMMDD形式の文字列に変換し、顧客ID（customer_id）とともに抽出せよ。データは10件を抽出すれば良い。

In [184]:
%%sql
SELECT customer_id,TO_CHAR(birth_day,'YYYYMMDD')
FROM customer
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS021313000114', '19810429'),
 ('CS037613000071', '19520401'),
 ('CS031415000172', '19761004'),
 ('CS028811000001', '19330327'),
 ('CS001215000145', '19950329'),
 ('CS020401000016', '19740915'),
 ('CS015414000103', '19770809'),
 ('CS029403000008', '19730817'),
 ('CS015804000004', '19310502'),
 ('CS033513000180', '19620711')]

---
> S-046: 顧客テーブル（customer）の申し込み日（application_date）はYYYYMMDD形式の文字列型でデータを保有している。これを日付型に変換し、顧客ID（customer_id）とともに抽出せよ。データは10件を抽出すれば良い。

In [197]:
%%sql
SELECT customer_id,TO_DATE(application_date,'YYYYMMDD')
FROM customer
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS021313000114', datetime.date(2015, 9, 5)),
 ('CS037613000071', datetime.date(2015, 4, 14)),
 ('CS031415000172', datetime.date(2015, 5, 29)),
 ('CS028811000001', datetime.date(2016, 1, 15)),
 ('CS001215000145', datetime.date(2017, 6, 5)),
 ('CS020401000016', datetime.date(2015, 2, 25)),
 ('CS015414000103', datetime.date(2015, 7, 22)),
 ('CS029403000008', datetime.date(2015, 5, 15)),
 ('CS015804000004', datetime.date(2015, 6, 7)),
 ('CS033513000180', datetime.date(2015, 7, 28))]

---
> S-047: レシート明細テーブル（receipt）の売上日（sales_ymd）はYYYYMMDD形式の数値型でデータを保有している。これを日付型に変換し、レシート番号(receipt_no)、レシートサブ番号（receipt_sub_no）とともに抽出せよ。データは10件を抽出すれば良い。

In [203]:
%%sql
SELECT TO_DATE(CAST(sales_ymd AS VARCHAR),'YYYYMMDD'),receipt_no,receipt_sub_no
FROM receipt 
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[(datetime.date(2018, 11, 3), 112, 1),
 (datetime.date(2018, 11, 18), 1132, 2),
 (datetime.date(2017, 7, 12), 1102, 1),
 (datetime.date(2019, 2, 5), 1132, 1),
 (datetime.date(2018, 8, 21), 1102, 2),
 (datetime.date(2019, 6, 5), 1112, 1),
 (datetime.date(2018, 12, 5), 1102, 2),
 (datetime.date(2019, 9, 22), 1102, 1),
 (datetime.date(2017, 5, 4), 1112, 2),
 (datetime.date(2019, 10, 10), 1102, 1)]

---
> S-048: レシート明細テーブル（receipt）の売上エポック秒（sales_epoch）は数値型のUNIX秒でデータを保有している。これを日付型に変換し、レシート番号(receipt_no)、レシートサブ番号（receipt_sub_no）とともに抽出せよ。データは10件を抽出すれば良い。

In [204]:
%%sql
SELECT TO_TIMESTAMP(sales_epoch),receipt_no,receipt_sub_no
FROM receipt
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[(datetime.datetime(2018, 11, 3, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 112, 1),
 (datetime.datetime(2018, 11, 18, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1132, 2),
 (datetime.datetime(2017, 7, 12, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1102, 1),
 (datetime.datetime(2019, 2, 5, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1132, 1),
 (datetime.datetime(2018, 8, 21, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1102, 2),
 (datetime.datetime(2019, 6, 5, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1112, 1),
 (datetime.datetime(2018, 12, 5, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1102, 2),
 (datetime.datetime(2019, 9, 22, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1102, 1),
 (datetime.datetime(2017, 5, 4, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1112, 2),
 (datetime.datetime(2019, 10, 10, 0, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1102, 1)]

---
> S-049: レシート明細テーブル（receipt）の販売エポック秒（sales_epoch）を日付型に変換し、「年」だけ取り出してレシート番号(receipt_no)、レシートサブ番号（receipt_sub_no）とともに抽出せよ。データは10件を抽出すれば良い。

In [223]:
%%sql
SELECT 
    TO_CHAR(EXTRACT(YEAR FROM TO_TIMESTAMP(sales_epoch)),'FM9999'),
    receipt_no,receipt_sub_no
FROM receipt
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('2018', 112, 1),
 ('2018', 1132, 2),
 ('2017', 1102, 1),
 ('2019', 1132, 1),
 ('2018', 1102, 2),
 ('2019', 1112, 1),
 ('2018', 1102, 2),
 ('2019', 1102, 1),
 ('2017', 1112, 2),
 ('2019', 1102, 1)]

---
> S-050: レシート明細テーブル（receipt）の売上エポック秒（sales_epoch）を日付型に変換し、「月」だけ取り出してレシート番号(receipt_no)、レシートサブ番号（receipt_sub_no）とともに抽出せよ。なお、「月」は0埋め2桁で取り出すこと。データは10件を抽出すれば良い。

In [226]:
%%sql
SELECT 
    TO_CHAR(EXTRACT(MONTH FROM TO_TIMESTAMP(sales_epoch)),'FM00'),
    receipt_no,receipt_sub_no
FROM receipt
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('11', 112, 1),
 ('11', 1132, 2),
 ('07', 1102, 1),
 ('02', 1132, 1),
 ('08', 1102, 2),
 ('06', 1112, 1),
 ('12', 1102, 2),
 ('09', 1102, 1),
 ('05', 1112, 2),
 ('10', 1102, 1)]

---
> S-051: レシート明細テーブル（receipt）の売上エポック秒を日付型に変換し、「日」だけ取り出してレシート番号(receipt_no)、レシートサブ番号（receipt_sub_no）とともに抽出せよ。なお、「日」は0埋め2桁で取り出すこと。データは10件を抽出すれば良い。

In [231]:
%%sql
SELECT 
    TO_CHAR(EXTRACT(DAY FROM TO_TIMESTAMP(sales_epoch)),'FM00') AS sales_day,
    receipt_no,receipt_sub_no
FROM receipt
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('03', 112, 1),
 ('18', 1132, 2),
 ('12', 1102, 1),
 ('05', 1132, 1),
 ('21', 1102, 2),
 ('05', 1112, 1),
 ('05', 1102, 2),
 ('22', 1102, 1),
 ('04', 1112, 2),
 ('10', 1102, 1)]

# CASE, SUBSTR, LEAST

---
> S-052: レシート明細テーブル（re1ceipt）の売上金額（amount）を顧客ID（customer_id）ごとに合計の上、売上金額合計に対して2,000円以下を0、2,000円より大きい金額を1に2値化し、顧客ID、売上金額合計とともに10件表示せよ。ただし、顧客IDが"Z"から始まるのものは非会員を表すため、除外して計算すること。

In [238]:
%%sql
SELECT 
    customer_id,SUM(amount) AS sum_amount, 
    CASE 
        WHEN SUM(amount)<=2000 THEN 0
        ELSE 1
    END AS FLG
FROM receipt
WHERE customer_id NOT LIKE'Z%'
GROUP BY customer_id
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS001311000059', 2302, 1),
 ('CS004614000122', 248, 0),
 ('CS003512000043', 298, 0),
 ('CS011615000061', 246, 0),
 ('CS029212000033', 3604, 1),
 ('CS007515000119', 7157, 1),
 ('CS034515000123', 3699, 1),
 ('CS004315000058', 490, 0),
 ('CS026414000014', 6671, 1),
 ('CS001615000099', 768, 0)]

---
> S-053: 顧客テーブル（customer）の郵便番号（postal_cd）に対し、東京（先頭3桁が100〜209のもの）を1、それ以外のものを0に２値化せよ。さらにレシート明細テーブル（receipt）と結合し、全期間において売上実績がある顧客数を、作成した2値ごとにカウントせよ。

In [252]:
%%sql
WITH 
post AS (
    SELECT 
        customer_id,postal_cd,
        CASE
            WHEN CAST(SUBSTR(postal_cd,1,3) AS INTEGER)>=100 AND CAST(SUBSTR(postal_cd,1,3) AS INTEGER)<=209 THEN 1
            ELSE 0
        END AS flg
    FROM customer
),
cust AS (
    SELECT customer_id
    FROM receipt
    GROUP BY customer_id
)
SELECT flg,COUNT(post.customer_id)
FROM post
JOIN cust
ON post.customer_id=cust.customer_id
GROUP BY flg

 * postgresql://padawan:***@db:5432/dsdojo_db
2 rows affected.

[(0, 3906), (1, 4400)]

---
> S-054: 顧客テーブル（customer）の住所（address）は、埼玉県、千葉県、東京都、神奈川県のいずれかとなっている。都道府県毎にコード値を作成し、顧客ID、住所とともに抽出せよ。値は埼玉県を11、千葉県を12、東京都を13、神奈川県を14とすること。結果は10件表示させれば良い。

In [255]:
%%sql
SELECT
    customer_id,address,
    CASE SUBSTR(address,1,3)
        WHEN '埼玉県' THEN 11
        WHEN '千葉県' THEN 12
        WHEN '東京都' THEN 13
        WHEN '神奈川' THEN 14
    END AS add_cd
FROM customer
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS021313000114', '神奈川県伊勢原市粟窪**********', 14),
 ('CS037613000071', '東京都江東区南砂**********', 13),
 ('CS031415000172', '東京都渋谷区代々木**********', 13),
 ('CS028811000001', '神奈川県横浜市泉区和泉町**********', 14),
 ('CS001215000145', '東京都大田区仲六郷**********', 13),
 ('CS020401000016', '東京都板橋区若木**********', 13),
 ('CS015414000103', '東京都江東区北砂**********', 13),
 ('CS029403000008', '千葉県浦安市海楽**********', 12),
 ('CS015804000004', '東京都江東区北砂**********', 13),
 ('CS033513000180', '神奈川県横浜市旭区善部町**********', 14)]

---
> S-055: レシート明細テーブル（receipt）の売上金額（amount）を顧客ID（customer_id）ごとに合計し、その合計金額の四分位点を求めよ。その上で、顧客ごとの売上金額合計に対して以下の基準でカテゴリ値を作成し、顧客ID、売上金額合計とともに表示せよ。カテゴリ値は上から順に1〜4とする。結果は10件表示させれば良い。
>
> - 最小値以上第一四分位未満
> - 第一四分位以上第二四分位未満
> - 第二四分位以上第三四分位未満
> - 第三四分位以上

In [269]:
%%sql
WITH 
    s AS (
        SELECT 
            customer_id,SUM(amount) AS sum_amount
        FROM receipt
        GROUP BY customer_id
    ),
    per AS (
        SELECT
            PERCENTILE_CONT(0.25) WITHIN GROUP (ORDER BY sum_amount) AS per25,
            PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY sum_amount) AS per50,
            PERCENTILE_CONT(0.75) WITHIN GROUP (ORDER BY sum_amount) AS per75
        FROM s
    )
SELECT 
    s.customer_id,s.sum_amount,
    CASE 
        WHEN s.sum_amount<per.per25 THEN 1
        WHEN s.sum_amount>=per.per25 AND s.sum_amount<per.per50 THEN 2
        WHEN s.sum_amount>=per.per50 AND s.sum_amount<per.per75 THEN 3
        WHEN s.sum_amount>=per.per75 THEN 4
    END AS flg
FROM s
CROSS JOIN per
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS001311000059', 2302, 3),
 ('CS004614000122', 248, 1),
 ('CS003512000043', 298, 1),
 ('CS011615000061', 246, 1),
 ('CS029212000033', 3604, 3),
 ('CS007515000119', 7157, 4),
 ('CS034515000123', 3699, 4),
 ('CS004315000058', 490, 1),
 ('CS026414000014', 6671, 4),
 ('CS001615000099', 768, 2)]

---
> S-056: 顧客テーブル（customer）の年齢（age）をもとに10歳刻みで年代を算出し、顧客ID（customer_id）、生年月日（birth_day）とともに抽出せよ。ただし、60歳以上は全て60歳代とすること。年代を表すカテゴリ名は任意とする。先頭10件を表示させればよい。

In [281]:
%%sql
SELECT 
    customer_id,birth_day,
    LEAST(CAST(TRUNC(age/10)*10 AS INTEGER),60) AS era
FROM customer
GROUP BY customer_id
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS001105000001', datetime.date(2000, 1, 14), 10),
 ('CS001112000009', datetime.date(2006, 8, 24), 10),
 ('CS001112000019', datetime.date(2001, 1, 31), 10),
 ('CS001112000021', datetime.date(2001, 12, 15), 10),
 ('CS001112000023', datetime.date(2004, 1, 26), 10),
 ('CS001112000024', datetime.date(2001, 1, 16), 10),
 ('CS001112000029', datetime.date(2005, 1, 24), 10),
 ('CS001112000030', datetime.date(2003, 3, 2), 10),
 ('CS001113000004', datetime.date(2003, 2, 22), 10),
 ('CS001113000010', datetime.date(2005, 5, 9), 10)]

---
> S-057: 前問題の抽出結果と性別（gender）を組み合わせ、新たに性別×年代の組み合わせを表すカテゴリデータを作成せよ。組み合わせを表すカテゴリの値は任意とする。先頭10件を表示させればよい。

In [284]:
%%sql
SELECT 
    customer_id,birth_day,
    gender || LEAST(CAST(TRUNC(age/10)*10 AS INTEGER),60) AS era
FROM customer
GROUP BY customer_id
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS001105000001', datetime.date(2000, 1, 14), '男性10'),
 ('CS001112000009', datetime.date(2006, 8, 24), '女性10'),
 ('CS001112000019', datetime.date(2001, 1, 31), '女性10'),
 ('CS001112000021', datetime.date(2001, 12, 15), '女性10'),
 ('CS001112000023', datetime.date(2004, 1, 26), '女性10'),
 ('CS001112000024', datetime.date(2001, 1, 16), '女性10'),
 ('CS001112000029', datetime.date(2005, 1, 24), '女性10'),
 ('CS001112000030', datetime.date(2003, 3, 2), '女性10'),
 ('CS001113000004', datetime.date(2003, 2, 22), '女性10'),
 ('CS001113000010', datetime.date(2005, 5, 9), '女性10')]

---
> S-058: 顧客テーブル（customer）の性別コード（gender_cd）をダミー変数化し、顧客ID（customer_id）とともに抽出せよ。結果は10件表示させれば良い。

In [294]:
%%sql
SELECT 
    customer_id,
    CASE gender_cd WHEN '0' THEN 1 ELSE 0 END AS male,
    CASE gender_cd WHEN '1' THEN 1 ELSE 0 END AS female,
    CASE gender_cd WHEN '9' THEN 1 ELSE 0 END AS unknown
FROM customer
GROUP BY customer_id
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS001105000001', 1, 0, 0),
 ('CS001112000009', 0, 1, 0),
 ('CS001112000019', 0, 1, 0),
 ('CS001112000021', 0, 1, 0),
 ('CS001112000023', 0, 1, 0),
 ('CS001112000024', 0, 1, 0),
 ('CS001112000029', 0, 1, 0),
 ('CS001112000030', 0, 1, 0),
 ('CS001113000004', 0, 1, 0),
 ('CS001113000010', 0, 1, 0)]

# 正規化

---
> S-059: レシート明細テーブル（receipt）の売上金額（amount）を顧客ID（customer_id）ごとに合計し、売上金額合計を平均0、標準偏差1に標準化して顧客ID、売上金額合計とともに表示せよ。標準化に使用する標準偏差は、不偏標準偏差と標本標準偏差のどちらでも良いものとする。ただし、顧客IDが"Z"から始まるのものは非会員を表すため、除外して計算すること。結果は10件表示させれば良い。

In [307]:
%%sql
WITH 
cust_sum AS (
    SELECT customer_id,SUM(amount) AS sum_amount
    FROM receipt
    WHERE customer_id NOT LIKE 'Z%'
    GROUP BY customer_id
),
avg_std AS (
    SELECT AVG(sum_amount) AS avg_amount,STDDEV_POP(sum_amount) AS std_amount
    FROM cust_sum
)
SELECT customer_id,sum_amount,(sum_amount-avg_amount)/std_amount AS REG
FROM cust_sum
CROSS JOIN avg_std
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS001311000059', 2302, Decimal('-0.09032946448390523062')),
 ('CS004614000122', 248, Decimal('-0.84533488878695858131')),
 ('CS003512000043', 298, Decimal('-0.82695598361891930792')),
 ('CS011615000061', 246, Decimal('-0.84607004499368015224')),
 ('CS029212000033', 3604, Decimal('0.38825722609183744835')),
 ('CS007515000119', 7157, Decimal('1.6942622273327082')),
 ('CS034515000123', 3699, Decimal('0.42317714591111206778')),
 ('CS004315000058', 490, Decimal('-0.75638098777364849812')),
 ('CS026414000014', 6671, Decimal('1.5156192690993665')),
 ('CS001615000099', 768, Decimal('-0.65419427503935013810'))]

---
> S-060: レシート明細テーブル（receipt）の売上金額（amount）を顧客ID（customer_id）ごとに合計し、売上金額合計を最小値0、最大値1に正規化して顧客ID、売上金額合計とともに表示せよ。ただし、顧客IDが"Z"から始まるのものは非会員を表すため、除外して計算すること。結果は10件表示させれば良い。

In [309]:
%%sql
WITH 
cust_sum AS (
    SELECT customer_id,SUM(amount) AS sum_amount
    FROM receipt
    WHERE customer_id NOT LIKE 'Z%'
    GROUP BY customer_id
),
avg_std AS (
    SELECT MAX(sum_amount) AS max_amount,MIN(sum_amount) AS min_amount
    FROM cust_sum
)
SELECT customer_id,sum_amount,(sum_amount-min_amount)*1.0/(max_amount-min_amount) AS REG
FROM cust_sum
CROSS JOIN avg_std
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS001311000059', 2302, Decimal('0.09697601668404588113')),
 ('CS004614000122', 248, Decimal('0.00773375043448036149')),
 ('CS003512000043', 298, Decimal('0.00990615224191866528')),
 ('CS011615000061', 246, Decimal('0.00764685436218282934')),
 ('CS029212000033', 3604, Decimal('0.15354535974973931178')),
 ('CS007515000119', 7157, Decimal('0.30791623218630517901')),
 ('CS034515000123', 3699, Decimal('0.15767292318387208898')),
 ('CS004315000058', 490, Decimal('0.01824817518248175182')),
 ('CS026414000014', 6671, Decimal('0.28680048661800486618')),
 ('CS001615000099', 768, Decimal('0.03032672923183872089'))]

# 対数化

---
> S-061: レシート明細テーブル（receipt）の売上金額（amount）を顧客ID（customer_id）ごとに合計し、売上金額合計を常用対数化（底=10）して顧客ID、売上金額合計とともに表示せよ。ただし、顧客IDが"Z"から始まるのものは非会員を表すため、除外して計算すること。結果は10件表示させれば良い。

In [316]:
%%sql
SELECT customer_id,SUM(amount),LOG(SUM(amount))
FROM receipt
WHERE customer_id NOT LIKE 'Z%'
GROUP BY customer_id
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS001311000059', 2302, 3.362105319293773),
 ('CS004614000122', 248, 2.3944516808262164),
 ('CS003512000043', 298, 2.4742162640762553),
 ('CS011615000061', 246, 2.3909351071033793),
 ('CS029212000033', 3604, 3.5567847823070253),
 ('CS007515000119', 7157, 3.8547310172139424),
 ('CS034515000123', 3699, 3.568084331315394),
 ('CS004315000058', 490, 2.690196080028514),
 ('CS026414000014', 6671, 3.824190940652583),
 ('CS001615000099', 768, 2.885361220031512)]

---
> S-062: レシート明細テーブル（receipt）の売上金額（amount）を顧客ID（customer_id）ごとに合計し、売上金額合計を自然対数化(底=e）して顧客ID、売上金額合計とともに表示せよ（ただし、顧客IDが"Z"から始まるのものは非会員を表すため、除外して計算すること）。結果は10件表示させれば良い。

In [317]:
%%sql
SELECT customer_id,SUM(amount),LN(SUM(amount))
FROM receipt
WHERE customer_id NOT LIKE 'Z%'
GROUP BY customer_id
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS001311000059', 2302, 7.741533589281828),
 ('CS004614000122', 248, 5.5134287461649825),
 ('CS003512000043', 298, 5.697093486505405),
 ('CS011615000061', 246, 5.5053315359323625),
 ('CS029212000033', 3604, 8.189799618728228),
 ('CS007515000119', 7157, 8.875846177738598),
 ('CS034515000123', 3699, 8.215817791832453),
 ('CS004315000058', 490, 6.194405391104672),
 ('CS026414000014', 6671, 8.805525052709516),
 ('CS001615000099', 768, 6.643789733147672)]

---
> S-063: 商品テーブル（product）の単価（unit_price）と原価（unit_cost）から、各商品の利益額を算出せよ。結果は10件表示させれば良い。

In [319]:
%%sql
SELECT product_cd,unit_price,unit_cost,unit_price-unit_cost
FROM product
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('P040101001', 198, 149, 49),
 ('P040101002', 218, 164, 54),
 ('P040101003', 230, 173, 57),
 ('P040101004', 248, 186, 62),
 ('P040101005', 268, 201, 67),
 ('P040101006', 298, 224, 74),
 ('P040101007', 338, 254, 84),
 ('P040101008', 420, 315, 105),
 ('P040101009', 498, 374, 124),
 ('P040101010', 580, 435, 145)]

---
> S-064: 商品テーブル（product）の単価（unit_price）と原価（unit_cost）から、各商品の利益率の全体平均を算出せよ。 ただし、単価と原価にはNULLが存在することに注意せよ。

In [323]:
%%sql
SELECT AVG((unit_price*1.0-unit_cost)/unit_price)
FROM product
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
1 rows affected.

[(Decimal('0.24911389885177001279'),)]

---
> S-065: 商品テーブル（product）の各商品について、利益率が30%となる新たな単価を求めよ。ただし、1円未満は切り捨てること。そして結果を10件表示させ、利益率がおよそ30％付近であることを確認せよ。ただし、単価（unit_price）と原価（unit_cost）にはNULLが存在することに注意せよ。

In [330]:
%%sql
WITH new_table AS (
SELECT product_cd,TRUNC(unit_cost/0.7) AS new_unit_price,unit_cost
FROM product
LIMIT 10
)

SELECT product_cd,new_unit_price,unit_cost,(new_unit_price*1.0-unit_cost)/new_unit_price AS rate
FROM new_table

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('P040101001', Decimal('212'), 149, Decimal('0.29716981132075471698')),
 ('P040101002', Decimal('234'), 164, Decimal('0.29914529914529914530')),
 ('P040101003', Decimal('247'), 173, Decimal('0.29959514170040485830')),
 ('P040101004', Decimal('265'), 186, Decimal('0.29811320754716981132')),
 ('P040101005', Decimal('287'), 201, Decimal('0.29965156794425087108')),
 ('P040101006', Decimal('320'), 224, Decimal('0.30000000000000000000')),
 ('P040101007', Decimal('362'), 254, Decimal('0.29834254143646408840')),
 ('P040101008', Decimal('450'), 315, Decimal('0.30000000000000000000')),
 ('P040101009', Decimal('534'), 374, Decimal('0.29962546816479400749')),
 ('P040101010', Decimal('621'), 435, Decimal('0.29951690821256038647'))]

---
> S-066: 商品テーブル（product）の各商品について、利益率が30%となる新たな単価を求めよ。今回は、1円未満を丸めること（四捨五入または偶数への丸めで良い）。そして結果を10件表示させ、利益率がおよそ30％付近であることを確認せよ。ただし、単価（unit_price）と原価（unit_cost）にはNULLが存在することに注意せよ。

In [333]:
%%sql
WITH new_table AS (
    SELECT ROUND(unit_cost/0.7) AS new_unit_price, unit_cost
    FROM product
)
SELECT new_unit_price,unit_cost,(new_unit_price-unit_cost)/new_unit_price AS rate
FROM new_table
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[(Decimal('213'), 149, Decimal('0.30046948356807511737')),
 (Decimal('234'), 164, Decimal('0.29914529914529914530')),
 (Decimal('247'), 173, Decimal('0.29959514170040485830')),
 (Decimal('266'), 186, Decimal('0.30075187969924812030')),
 (Decimal('287'), 201, Decimal('0.29965156794425087108')),
 (Decimal('320'), 224, Decimal('0.30000000000000000000')),
 (Decimal('363'), 254, Decimal('0.30027548209366391185')),
 (Decimal('450'), 315, Decimal('0.30000000000000000000')),
 (Decimal('534'), 374, Decimal('0.29962546816479400749')),
 (Decimal('621'), 435, Decimal('0.29951690821256038647'))]

---
> S-067: 商品テーブル（product）の各商品について、利益率が30%となる新たな単価を求めよ。今回は、1円未満を切り上げること。そして結果を10件表示させ、利益率がおよそ30％付近であることを確認せよ。ただし、単価（unit_price）と原価（unit_cost）にはNULLが存在することに注意せよ。

In [334]:
%%sql
WITH new_table AS (
    SELECT CEIL(unit_cost/0.7) AS new_unit_price, unit_cost
    FROM product
)
SELECT new_unit_price,unit_cost,(new_unit_price-unit_cost)/new_unit_price AS rate
FROM new_table
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[(Decimal('213'), 149, Decimal('0.30046948356807511737')),
 (Decimal('235'), 164, Decimal('0.30212765957446808511')),
 (Decimal('248'), 173, Decimal('0.30241935483870967742')),
 (Decimal('266'), 186, Decimal('0.30075187969924812030')),
 (Decimal('288'), 201, Decimal('0.30208333333333333333')),
 (Decimal('320'), 224, Decimal('0.30000000000000000000')),
 (Decimal('363'), 254, Decimal('0.30027548209366391185')),
 (Decimal('450'), 315, Decimal('0.30000000000000000000')),
 (Decimal('535'), 374, Decimal('0.30093457943925233645')),
 (Decimal('622'), 435, Decimal('0.30064308681672025723'))]

---
> S-068: 商品テーブル（product）の各商品について、消費税率10%の税込み金額を求めよ。 1円未満の端数は切り捨てとし、結果は10件表示すれば良い。ただし、単価（unit_price）にはNULLが存在することに注意せよ。

In [337]:
%%sql
SELECT product_cd,TRUNC(unit_price*1.1)
FROM product
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('P040101001', Decimal('217')),
 ('P040101002', Decimal('239')),
 ('P040101003', Decimal('253')),
 ('P040101004', Decimal('272')),
 ('P040101005', Decimal('294')),
 ('P040101006', Decimal('327')),
 ('P040101007', Decimal('371')),
 ('P040101008', Decimal('462')),
 ('P040101009', Decimal('547')),
 ('P040101010', Decimal('638'))]

---
> S-069: レシート明細テーブル（receipt）と商品テーブル（product）を結合し、顧客毎に全商品の売上金額合計と、カテゴリ大区分（category_major_cd）が"07"（瓶詰缶詰）の売上金額合計を計算の上、両者の比率を求めよ。抽出対象はカテゴリ大区分"07"（瓶詰缶詰）の売上実績がある顧客のみとし、結果は10件表示させればよい。

In [346]:
%%sql
WITH
amount_all AS ( 
    SELECT customer_id,SUM(amount) AS amo_all
    FROM receipt
    GROUP BY customer_id
),
amount_07 AS ( 
    SELECT customer_id,SUM(amount) AS amo_07
    FROM receipt AS r
    JOIN product AS p
    ON r.product_cd=p.product_cd AND p.category_major_cd='07'
    GROUP BY customer_id
)

SELECT amount_all.customer_id,amount_all.amo_all,amount_07.amo_07,amount_07.amo_07*1.0/amount_all.amo_all AS rate
FROM amount_all
JOIN amount_07 
ON amount_all.customer_id=amount_07.customer_id
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS001311000059', 2302, 102, Decimal('0.04430929626411815812')),
 ('CS011615000061', 246, 98, Decimal('0.39837398373983739837')),
 ('CS029212000033', 3604, 3604, Decimal('1.00000000000000000000')),
 ('CS007515000119', 7157, 2832, Decimal('0.39569652088864049183')),
 ('CS034515000123', 3699, 1202, Decimal('0.32495268991619356583')),
 ('CS026414000014', 6671, 3142, Decimal('0.47099385399490331285')),
 ('CS001615000099', 768, 318, Decimal('0.41406250000000000000')),
 ('CS010515000082', 1482, 553, Decimal('0.37314439946018893387')),
 ('CS019315000045', 813, 380, Decimal('0.46740467404674046740')),
 ('CS008513000099', 1322, 210, Decimal('0.15885022692889561271'))]

---
> S-070: レシート明細テーブル（receipt）の売上日（sales_ymd）に対し、顧客テーブル（customer）の会員申込日（application_date）からの経過日数を計算し、顧客ID（customer_id）、売上日、会員申込日とともに表示せよ。結果は10件表示させれば良い（なお、sales_ymdは数値、application_dateは文字列でデータを保持している点に注意）。

In [350]:
%%sql
SELECT 
    r.customer_id,r.sales_ymd,c.application_date,
    EXTRACT (DAY FROM TO_TIMESTAMP(CAST(r.sales_ymd AS VARCHAR),'YYYYMMDD')-TO_TIMESTAMP(c.application_date,'YYYYMMDD'))
FROM receipt AS r
JOIN customer AS c
ON r.customer_id= c.customer_id
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS006214000001', 20181103, '20150201', Decimal('1371')),
 ('CS008415000097', 20181118, '20150322', Decimal('1337')),
 ('CS028414000014', 20170712, '20150711', Decimal('732')),
 ('CS025415000050', 20180821, '20160131', Decimal('933')),
 ('CS003515000195', 20190605, '20150306', Decimal('1552')),
 ('CS024514000042', 20181205, '20151010', Decimal('1152')),
 ('CS040415000178', 20190922, '20150627', Decimal('1548')),
 ('CS027514000015', 20191010, '20151101', Decimal('1439')),
 ('CS025415000134', 20190918, '20150720', Decimal('1521')),
 ('CS021515000126', 20171010, '20150508', Decimal('886'))]

---
> S-071: レシート明細テーブル（receipt）の売上日（sales_ymd）に対し、顧客テーブル（customer）の会員申込日（application_date）からの経過月数を計算し、顧客ID（customer_id）、売上日、会員申込日とともに表示せよ。結果は10件表示させれば良い（なお、sales_ymdは数値、application_dateは文字列でデータを保持している点に注意）。1ヶ月未満は切り捨てること。

In [363]:
%%sql
WITH inter AS (
    SELECT r.customer_id,r.sales_ymd,c.application_date,AGE(TO_TIMESTAMP(CAST(r.sales_ymd AS VARCHAR),'YYYYMMDD'),TO_TIMESTAMP(c.application_date,'YYYYMMDD')) AS interval
    FROM receipt AS r
    JOIN customer AS c
    ON r.customer_id=c.customer_id
)
SELECT customer_id,sales_ymd,application_date,EXTRACT (YEAR FROM interval) * 12 + EXTRACT (MONTH FROM interval) AS month
FROM inter
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS006214000001', 20181103, '20150201', Decimal('45')),
 ('CS008415000097', 20181118, '20150322', Decimal('43')),
 ('CS028414000014', 20170712, '20150711', Decimal('24')),
 ('CS025415000050', 20180821, '20160131', Decimal('30')),
 ('CS003515000195', 20190605, '20150306', Decimal('50')),
 ('CS024514000042', 20181205, '20151010', Decimal('37')),
 ('CS040415000178', 20190922, '20150627', Decimal('50')),
 ('CS027514000015', 20191010, '20151101', Decimal('47')),
 ('CS025415000134', 20190918, '20150720', Decimal('49')),
 ('CS021515000126', 20171010, '20150508', Decimal('29'))]

---
> S-072: レシート明細テーブル（receipt）の売上日（sales_ymd）に対し、顧客テーブル（customer）の会員申込日（application_date）からの経過年数を計算し、顧客ID（customer_id）、売上日、会員申込日とともに表示せよ。結果は10件表示させれば良い（なお、sales_ymdは数値、application_dateは文字列でデータを保持している点に注意）。1年未満は切り捨てること。

In [364]:
%%sql
WITH inter AS (
    SELECT r.customer_id,r.sales_ymd,c.application_date,AGE(TO_TIMESTAMP(CAST(r.sales_ymd AS VARCHAR),'YYYYMMDD'),TO_TIMESTAMP(c.application_date,'YYYYMMDD')) AS interval
    FROM receipt AS r
    JOIN customer AS c
    ON r.customer_id=c.customer_id
)
SELECT customer_id,sales_ymd,application_date,EXTRACT (YEAR FROM interval) AS year
FROM inter
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS006214000001', 20181103, '20150201', Decimal('3')),
 ('CS008415000097', 20181118, '20150322', Decimal('3')),
 ('CS028414000014', 20170712, '20150711', Decimal('2')),
 ('CS025415000050', 20180821, '20160131', Decimal('2')),
 ('CS003515000195', 20190605, '20150306', Decimal('4')),
 ('CS024514000042', 20181205, '20151010', Decimal('3')),
 ('CS040415000178', 20190922, '20150627', Decimal('4')),
 ('CS027514000015', 20191010, '20151101', Decimal('3')),
 ('CS025415000134', 20190918, '20150720', Decimal('4')),
 ('CS021515000126', 20171010, '20150508', Decimal('2'))]

---
> S-073: レシート明細テーブル（receipt）の売上日（sales_ymd）に対し、顧客テーブル（customer）の会員申込日（application_date）からのエポック秒による経過時間を計算し、顧客ID（customer_id）、売上日、会員申込日とともに表示せよ。結果は10件表示させれば良い（なお、sales_ymdは数値、application_dateは文字列でデータを保持している点に注意）。なお、時間情報は保有していないため各日付は0時0分0秒を表すものとする。

In [366]:
%%sql

SELECT r.customer_id,r.sales_ymd,c.application_date,EXTRACT (epoch FROM TO_TIMESTAMP(CAST(r.sales_ymd AS VARCHAR),'YYYYMMDD')-TO_TIMESTAMP(c.application_date,'YYYYMMDD')) AS epoch
FROM receipt AS r
JOIN customer AS c
ON r.customer_id=c.customer_id
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS006214000001', 20181103, '20150201', Decimal('118454400.000000')),
 ('CS008415000097', 20181118, '20150322', Decimal('115516800.000000')),
 ('CS028414000014', 20170712, '20150711', Decimal('63244800.000000')),
 ('CS025415000050', 20180821, '20160131', Decimal('80611200.000000')),
 ('CS003515000195', 20190605, '20150306', Decimal('134092800.000000')),
 ('CS024514000042', 20181205, '20151010', Decimal('99532800.000000')),
 ('CS040415000178', 20190922, '20150627', Decimal('133747200.000000')),
 ('CS027514000015', 20191010, '20151101', Decimal('124329600.000000')),
 ('CS025415000134', 20190918, '20150720', Decimal('131414400.000000')),
 ('CS021515000126', 20171010, '20150508', Decimal('76550400.000000'))]

---
> S-074: レシート明細テーブル（receipt）の売上日（sales_ymd）に対し、当該週の月曜日からの経過日数を計算し、売上日、当該週の月曜日付とともに表示せよ。結果は10件表示させれば良い（なお、sales_ymdは数値でデータを保持している点に注意）。

In [387]:
%%sql
WITH 
timestamp AS (
    SELECT r.customer_id,r.sales_ymd,c.application_date,TO_DATE(CAST(r.sales_ymd AS VARCHAR),'YYYYMMDD') AS dt
    FROM receipt AS r
    JOIN customer AS c
    ON r.customer_id=c.customer_id
),
days_of_week AS (
SELECT customer_id,sales_ymd,application_date,dt,CAST (EXTRACT (dow FROM dt-1) AS INTEGER) AS dow
FROM timestamp
)
SELECT customer_id,sales_ymd,application_date,dt,dow,dt-dow
FROM days_of_week
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS006214000001', 20181103, '20150201', datetime.date(2018, 11, 3), 5, datetime.date(2018, 10, 29)),
 ('CS008415000097', 20181118, '20150322', datetime.date(2018, 11, 18), 6, datetime.date(2018, 11, 12)),
 ('CS028414000014', 20170712, '20150711', datetime.date(2017, 7, 12), 2, datetime.date(2017, 7, 10)),
 ('CS025415000050', 20180821, '20160131', datetime.date(2018, 8, 21), 1, datetime.date(2018, 8, 20)),
 ('CS003515000195', 20190605, '20150306', datetime.date(2019, 6, 5), 2, datetime.date(2019, 6, 3)),
 ('CS024514000042', 20181205, '20151010', datetime.date(2018, 12, 5), 2, datetime.date(2018, 12, 3)),
 ('CS040415000178', 20190922, '20150627', datetime.date(2019, 9, 22), 6, datetime.date(2019, 9, 16)),
 ('CS027514000015', 20191010, '20151101', datetime.date(2019, 10, 10), 3, datetime.date(2019, 10, 7)),
 ('CS025415000134', 20190918, '20150720', datetime.date(2019, 9, 18), 2, datetime.date(2019, 9, 16)),
 ('CS021515000126', 20171010, '20150508', datetime.date(2017, 10, 10), 1, datetime.date(2017, 10, 9))]

---
> S-075: 顧客テーブル（customer）からランダムに1%のデータを抽出し、先頭から10件データを抽出せよ。

In [390]:
%%sql
SELECT *
FROM customer
WHERE RANDOM()<=0.01
LIMIT 10

 * postgresql://padawan:***@db:5432/dsdojo_db
10 rows affected.

[('CS007314000053', '宮脇 咲', '1', '女性', datetime.date(1981, 4, 4), 37, '285-0855', '千葉県佐倉市井野**********', 'S12007', '20141219', '0-00000000-0'),
 ('CS002511000074', '小平 路子', '1', '女性', datetime.date(1964, 12, 15), 54, '187-0001', '東京都小平市大沼町**********', 'S13002', '20160322', '0-00000000-0'),
 ('CS001411000027', '長瀬 礼子', '1', '女性', datetime.date(1969, 5, 15), 49, '210-0024', '神奈川県川崎市川崎区日進町**********', 'S13001', '20150301', 'A-20091001-1'),
 ('CS004314000055', '松井 莉沙', '1', '女性', datetime.date(1979, 7, 4), 39, '167-0022', '東京都杉並区下井草**********', 'S13004', '20150618', '9-20100423-8'),
 ('CS020413000290', '杉本 季衣', '1', '女性', datetime.date(1975, 1, 20), 44, '173-0003', '東京都板橋区加賀**********', 'S13020', '20160525', '0-00000000-0'),
 ('CS021413000094', '宇佐美 メイサ', '1', '女性', datetime.date(1970, 5, 18), 48, '259-1131', '神奈川県伊勢原市伊勢原**********', 'S14021', '20150422', '0-00000000-0'),
 ('CS003311000062', '高柳 由宇', '1', '女性', datetime.date(1982, 9, 15), 36, '206-0812', '東京都稲城市矢野口**********', 'S13003', '20151201', '4-20100921-2'),
 ('CS002514000312', '長浜 ひかり', '1', '女性', datetime.date(1966, 2, 24), 53, '184-0015', '東京都小金井市貫井北町**********', 'S13002', '20171203', '0-00000000-0'),
 ('CS029411000064', '北沢 はるみ', '1', '女性', datetime.date(1977, 4, 12), 41, '132-0014', '東京都江戸川区東瑞江**********', 'S12029', '20160615', '0-00000000-0'),
 ('CS034715000016', '久野 しぼり', '1', '女性', datetime.date(1947, 12, 8), 71, '216-0001', '神奈川県川崎市宮前区野川**********', 'S14034', '20150703', '0-00000000-0')]

---
> S-076:  顧客テーブル（customer）から性別（gender_cd）の割合に基づきランダムに10%のデータを層化抽出し、性別ごとに件数を集計せよ。

In [ ]:
%%sql

---
> S-077: レシート明細テーブル（receipt）の売上金額（amount）を顧客単位に合計し、合計した売上金額の外れ値を抽出せよ。ただし、顧客IDが"Z"から始まるのものは非会員を表すため、除外して計算すること。なお、ここでは外れ値を平均から3σ以上離れたものとする。結果は10件表示させれば良い。

In [ ]:
%%sql

---
> S-078: レシート明細テーブル（receipt）の売上金額（amount）を顧客単位に合計し、合計した売上金額の外れ値を抽出せよ。ただし、顧客IDが"Z"から始まるのものは非会員を表すため、除外して計算すること。なお、ここでは外れ値を第一四分位と第三四分位の差であるIQRを用いて、「第一四分位数-1.5×IQR」よりも下回るもの、または「第三四分位数+1.5×IQR」を超えるものとする。結果は10件表示させれば良い。

In [ ]:
%%sql

---
> S-079: 商品テーブル（product）の各項目に対し、欠損数を確認せよ。

In [ ]:
%%sql

---
> S-080: 商品テーブル（product）のいずれかの項目に欠損が発生しているレコードを全て削除した新たなproduct_1を作成せよ。なお、削除前後の件数を表示させ、前設問で確認した件数だけ減少していることも確認すること。

In [ ]:
%%sql

---
> S-081: 単価（unit_price）と原価（unit_cost）の欠損値について、それぞれの平均値で補完した新たなproduct_2を作成せよ。なお、平均値については1円未満を丸めること（四捨五入または偶数への丸めで良い）。補完実施後、各項目について欠損が生じていないことも確認すること。

In [ ]:
%%sql

---
> S-082:  単価（unit_price）と原価（unit_cost）の欠損値について、それぞれの中央値で補完した新たなproduct_3を作成せよ。なお、中央値については1円未満を丸めること（四捨五入または偶数への丸めで良い）。補完実施後、各項目について欠損が生じていないことも確認すること。

In [ ]:
%%sql

---
> S-083: 単価（unit_price）と原価（unit_cost）の欠損値について、各商品の小区分（category_small_cd）ごとに算出した中央値で補完した新たなproduct_4を作成せよ。なお、中央値については1円未満を丸めること（四捨五入または偶数への丸めで良い）。補完実施後、各項目について欠損が生じていないことも確認すること。

In [ ]:
%%sql

---
> S-084: 顧客テーブル（customer）の全顧客に対し、全期間の売上金額に占める2019年売上金額の割合を計算せよ。ただし、売上実績がない場合は0として扱うこと。そして計算した割合が0超のものを抽出せよ。 結果は10件表示させれば良い。

In [ ]:
%%sql

---
> S-085: 顧客テーブル（customer）の全顧客に対し、郵便番号（postal_cd）を用いて経度緯度変換用テーブル（geocode）を紐付け、新たなcustomer_1を作成せよ。ただし、複数紐づく場合は経度（longitude）、緯度（latitude）それぞれ平均を算出すること。

In [ ]:
%%sql

---
> S-086: 前設問で作成した緯度経度つき顧客テーブル（customer_1）に対し、申込み店舗コード（application_store_cd）をキーに店舗テーブル（store）と結合せよ。そして申込み店舗の緯度（latitude）・経度情報（longitude)と顧客の緯度・経度を用いて距離（km）を求め、顧客ID（customer_id）、顧客住所（address）、店舗住所（address）とともに表示せよ。計算式は簡易式で良いものとするが、その他精度の高い方式を利用したライブラリを利用してもかまわない。結果は10件表示すれば良い。

$$
緯度（ラジアン）：\phi \\
経度（ラジアン）：\lambda \\
距離L = 6371 * arccos(sin \phi_1 * sin \phi_2
+ cos \phi_1 * cos \phi_2 * cos(\lambda_1 − \lambda_2))
$$

In [ ]:
%%sql

---
> S-087: 顧客テーブル（customer）では、異なる店舗での申込みなどにより同一顧客が複数登録されている。名前（customer_name）と郵便番号（postal_cd）が同じ顧客は同一顧客とみなし、1顧客1レコードとなるように名寄せした名寄顧客テーブル（customer_u）を作成せよ。ただし、同一顧客に対しては売上金額合計が最も高いものを残すものとし、売上金額合計が同一もしくは売上実績がない顧客については顧客ID（customer_id）の番号が小さいものを残すこととする。

In [ ]:
%%sql

---
> S-088: 前設問で作成したデータを元に、顧客テーブルに統合名寄IDを付与したテーブル（customer_n）を作成せよ。ただし、統合名寄IDは以下の仕様で付与するものとする。
>
>- 重複していない顧客：顧客ID（customer_id）を設定
>- 重複している顧客：前設問で抽出したレコードの顧客IDを設定

In [ ]:
%%sql

---
> S-089: 売上実績がある顧客に対し、予測モデル構築のため学習用データとテスト用データに分割したい。それぞれ8:2の割合でランダムにデータを分割せよ。

In [ ]:
%%sql

---
> S-090: レシート明細テーブル（receipt）は2017年1月1日〜2019年10月31日までのデータを有している。売上金額（amount）を月次で集計し、学習用に12ヶ月、テスト用に6ヶ月のモデル構築用データを3セット作成せよ。データの持ち方は自由とする。

In [ ]:
%%sql

---
> S-091: 顧客テーブル（customer）の各顧客に対し、売上実績がある顧客数と売上実績がない顧客数が1:1となるようにアンダーサンプリングで抽出せよ。

In [ ]:
%%sql

---
> S-092: 顧客テーブル（customer）では、性別に関する情報が非正規化の状態で保持されている。これを第三正規化せよ。

In [ ]:
%%sql

---
> S-093: 商品テーブル（product）では各カテゴリのコード値だけを保有し、カテゴリ名は保有していない。カテゴリテーブル（category）と組み合わせて非正規化し、カテゴリ名を保有した新たな商品テーブルを作成せよ。

In [ ]:
%%sql

---
> S-094: 先に作成したカテゴリ名付き商品データを以下の仕様でファイル出力せよ。出力先のパスは"/tmp/data"を指定することでJupyterの"/work/data"と共有されるようになっている。なお、COPYコマンドの権限は付与済みである。
>
> - ファイル形式はCSV（カンマ区切り）
> - ヘッダ有り
> - 文字コードはUTF-8

In [ ]:
%%sql

---
> S-095: 先に作成したカテゴリ名付き商品データを以下の仕様でファイル出力せよ。出力先のパスは"/tmp/data"を指定することでJupyterの"/work/data"と共有されるようになっている。なお、COPYコマンドの権限は付与済みである。
>
> - ファイル形式はCSV（カンマ区切り）
> - ヘッダ有り
> - 文字コードはSJIS

In [ ]:
%%sql

---
> S-096: 先に作成したカテゴリ名付き商品データを以下の仕様でファイル出力せよ。出力先のパスは"/tmp/data"を指定することでJupyterの"/work/data"と共有されるようになっている。なお、COPYコマンドの権限は付与済みである。
>
> - ファイル形式はCSV（カンマ区切り）
> - ヘッダ無し
> - 文字コードはUTF-8

In [ ]:
%%sql

---
> S-097: 先に作成した以下形式のファイルを読み込み、テーブルを作成せよ。また、先頭3件を表示させ、正しく取り込まれていることを確認せよ。
>
> - ファイル形式はCSV（カンマ区切り）
> - ヘッダ有り
> - 文字コードはUTF-8

In [ ]:
%%sql

---
> S-098: 先に作成した以下形式のファイルを読み込み、テーブルを作成せよ。また、先頭3件を表示させ、正しく取り込まれていることを確認せよ。
>
> - ファイル形式はCSV（カンマ区切り）
> - ヘッダ無し
> - 文字コードはUTF-8

In [ ]:
%%sql

---
> S-099: 先に作成したカテゴリ名付き商品データを以下の仕様でファイル出力せよ。出力先のパスは"/tmp/data"を指定することでJupyterの"/work/data"と共有されるようになっている。なお、COPYコマンドの権限は付与済みである。
>
> - ファイル形式はTSV（タブ区切り）
> - ヘッダ有り
> - 文字コードはUTF-8

In [ ]:
%%sql

---
> S-100: 先に作成した以下形式のファイルを読み込み、テーブルを作成せよ。また、先頭3件を表示させ、正しく取り込まれていることを確認せよ。
>
> - ファイル形式はTSV（タブ区切り）
> - ヘッダ有り
> - 文字コードはUTF-8

In [ ]:
%%sql

# これで１００本終わりです。おつかれさまでした！